/************************************************************
 * 版权：严禁商业用途，仅供学习使用。 
 * 文件：TaskDefine.h
 * 作者: 凌智君
 * 平台: 凌跃智能雷神开发板
 * 微信: YunXiang_TechShare  
 * Q Q: 2228398717
 * 公众号：凌智君
************************************************************/
#ifndef __TASKDEFINE_H
#define __TASKDEFINE_H

/************************* 头文件 *************************/

#include "HeaderFiles.h"


/************************* 宏定义 *************************/

/************************ 变量定义 ************************/

/************************ 函数定义 ************************/

void Setup_task(void);  // 任务启动函数

extern void MainTaskInit(void);
extern void WirtePowerONOFF(void);
extern void MainTaskLoop(void);


			    
#endif


/****************************End*****************************/

