/************************************************************
 * 版权：严禁商业用途，仅供学习使用。 
 * 文件：CAN.h
 * 作者: 凌智君
 * 平台: 凌跃智能雷神开发板
 * 微信: YunXiang_TechShare  
 * Q Q: 2228398717
 * 公众号：凌智君
************************************************************/
#ifndef __CAN_H
#define __CAN_H

/************************* 头文件 *************************/

#include "HeaderFiles.h"

/************************* 宏定义 *************************/


/************************ 变量定义 ************************/
extern can_receive_message_struct receive_message;    // 接收数据结构体
extern can_trasnmit_message_struct transmit_message;  // 发送数据结构体

/************************ 函数定义 ************************/

void CAN0_Init(void);      // CAN0 初始化
void CAN1_Init(void);      // CAN1 初始化


#endif


/****************************End*****************************/

